import { Step } from "./path-context";

const be = {
    steps: [
        {
            id: "0",
            title: "Перад тым як пачаць",
            description: "Дзеля далейшага адсочвання прагрэсу, выканай, калі ласка, чатыры папярэдніх малюнка. На адваротным баку кожнага падпішы дату і свае адчуванні адносна намаляванага: што падабаецца, што не, як і што хацелася бы змяніць і г.д. Гэтыя малюнкі спатрэбяцца табе пазней, каб бачыць як ты расцеш.",
            type: "start",
            exercises: [
                {
                    id: "0-0",
                    title: "Малюнак чалавека якога бачыш",
                    description: "Першы малюнак - любы чалавек, якога бачыш перад сабой. Фотаздымак не падыдзе, трэба маляваць з натуры. Чалавек цалкам, ці партрэт - не важна, як табе падабаецца. І без перфекцыянізма - гэтыя малюнкі - кропка адліку, а не твой першы шэдэўр.",
                    pictureUrl: "/src/assets/man1.png"
                },
                {
                    id: "0-1",
                    title: "Малюнак чалавека з галавы",
                    description: "Цяпер уяві і намалюй чалавека. Дэталі, фон і атрыбуты - не важны.",
                    pictureUrl: "/src/assets/man2.png"
                },
                {
                    id: "0-2",
                    title: "Малюнак тваёй рукі",
                    description: "Наступны малюнак - твая рука. Адной малюеш, а на другую глядзіш і малюеш яе.",
                    pictureUrl: "/src/assets/hand.png"
                },
                {
                    id: "0-3",
                    title: "Крэсла якое бачыш",
                    description: "І нарэшце - крэсла якое ты бачыш, не на фотаздымку, а перад сабой.",
                    pictureUrl: "/src/assets/chair.png"
                },
            ],
        },
        {
            id: "1",
            title: "Левае і правае паўшар'і мозга",
            description: "Тут будзе апісанне, але крышачку пазней.",
            type: "read",
        },
        {
            id: "2",
            title: "Вазы-твары ці вазы Рубіна",
            description: "Апісанне...",
            type: "practice",
            exercises: [
                {
                    id: "2-0",
                    title: "Твар чалавека ў профіль",
                    description: "Апісанне...",
                    pictureUrl: "/src/assets/rubin1.png"
                },
                {
                    id: "2-1",
                    title: "Твар пачвары ў профіль",
                    description: "Апісанне...",
                    pictureUrl: "/src/assets/rubin2.png"
                },
            ],
        }
    ] as Step[]
};

const ru = {
    steps: [
    {
        id: "0",
        title: "Перед тем как начать",
        description: "Выполни, пожалуйста, предварительные рисунки, на обратной стороне каждого поставь дату и опиши свои ощущения касательно нарисованного, что нравится, а что нет. Эти рисунки пригодятся тебе в дальнейшем для отслеживания прогресса.",
        type: "start",
        exercises: [
            {
                id: "0-0",
                title: "Рисунок человека которого видишь",
                description: "Первый рисунок - любой человек, которого видишь в живую. Фотография не подойдёт, рисуй с натуры. Человек целиком, или же портрет - не важно, как тебе нравится. И без перфекционизма - эти рисунки - точка отсчёта, а не твой первый шедевр.",
                pictureUrl: "/src/assets/man1.png"
            },
            {
                id: "0-1",
                title: "Рисунок человека из головы",
                description: "Теперь вообрази и нарисуй человека. Не вдавайся в сильные детали, фон и атрибуты - не важны.",
                pictureUrl: "/src/assets/man2.png"
            },
            {
                id: "0-2",
                title: "Рисунок твоей руки",
                description: "Следующий рисунок - твоя рука, левши рисуют правую, правши - левую.",
                pictureUrl: "/src/assets/hand.png"
            },
            {
                id: "0-3",
                title: "Стул который видишь",
                description: "Выбери какой-нибудь стул, лучше обычный, но можно и вычурный, не на фотографии, а в живую, и нарисуй.",
                pictureUrl: "/src/assets/chair.png"
            },
        ],
    },
    {
        id: "1",
        title: "Левое и правое полушария мозга",
        description: "Тут будет описание, но чуточку позже.",
        type: "read",
    },
    {
        id: "2",
        title: "Вазы-лица или вазы Рубина",
        description: "Описание...",
        type: "practice",
        exercises: [
            {
                id: "2-0",
                title: "Лицо человека в профиль",
                description: "Описание...",
                pictureUrl: "/src/assets/rubin1.png"
            },
            {
                id: "2-1",
                title: "Лицо чудовища в профиль",
                description: "Описание...",
                pictureUrl: "/src/assets/rubin2.png"
            },
        ],
    }
] as Step[]
};

export default {
    "be": be,
    "ru": ru,
}